[
  {
    "name": "A.V. Granite Design Works Ltd",
    "category": "Granite Countertops and Installation",
    "address": "5-2945 Alberni Hwy, Port Alberni, BC",
    "phone": "250-724-5709",
    "website": "https://albernichamber.ca/directory/av-granite-design-works-ltd",
    "email": "",
    "description": "A.V. Granite Design Works is a granite countertops and installation company in Port Alberni, BC."
  },
  {
    "name": "Accurate Home Inspection - Todd Flaro",
    "category": "Home Inspection",
    "address": "/",
    "phone": "/",
    "website": "https://albernichamber.ca/directory/accurate-home-inspection",
    "email": "/",
    "description": "Quality Home Inspection Service"
  },
  {
    "name": "Alberni Brewing Company",
    "category": "Brewery",
    "address": "",
    "phone": "778-744-8010",
    "website": "https://albernibrewingcompany.ca/menu",
    "email": "",
    "description": "Alberni Brewing Company is committed to producing & serving craft beer at its finest quality, and offers a plentiful menu that complements the brewhouse."
  },
  {
    "name": "Alberni Charters",
    "category": "Fishing Charter",
    "address": "",
    "phone": "250-735-6503",
    "website": "https://albernicharters.com",
    "email": "",
    "description": "Alberni Charters is one of Vancouver Island’s finest private charter companies offering fishing, crabbing, prawning, whale watching, and sightseeing experiences with on-board accommodations."
  },
  {
    "name": "93.3 The Peak FM",
    "category": "Radio Station",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/933-peak-fm",
    "email": "",
    "description": "We are ‘The Sound of the Valley'. We are the source for breaking news, community information, Bulldogs play-by-play, and great music through the day!"
  },
  {
    "name": "Alberni District Co-operative Association",
    "category": "Convenience Store, Gas Diesel and Marine, Oil & Lubes and Liquor Store",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-district-co-operative-association",
    "email": "",
    "description": "Co-op is here to serve our members with products and services that help build, feed and fuel individuals and communities. We are a different kind of business; being member-owned means that any profits are returned to our members and stay in the local economy. We live where you live, work where you work and help grow the economy right here. We are your neighbours and we make sustainable investments in the communities we share."
  },
  {
    "name": "Access IDEAs",
    "category": "Educational Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/access-ideas",
    "email": "",
    "description": "Access IDEAs provides educational assessments for K-12 and postsecondary purposes, as well as counsellor therapist services for all ages."
  },
  {
    "name": "Alberni Online (Formerly Alberni Design)",
    "category": "Web Design",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-online-formerly-alberni-design",
    "email": "",
    "description": "Alberni Design is the premier web design studio on the West Coast of Vancouver Island, specializing in business web sites and custom web applications. We are a custom web design & development company, specializing in building beautiful & easy-to-manage business web sites. We also provide web hosting, web maintenance, and web marketing services to our clients."
  },
  {
    "name": "Alberni Chrysler",
    "category": "Automotive",
    "address": "Port Alberni, BC",
    "phone": "250.723.5331",
    "website": "https://www.albernicdjr.ca/",
    "email": "",
    "description": "At Alberni Chrysler, our staff treats the needs of each individual customer with a no-pressure, friendly and approachable manner. Our Sales, Service, Financing and Parts Department staff are all knowledgeable individuals, with many years of experience within the automotive industry. We provide a vast selection of new and used vehicles, exceptional car care and customer service with a smile."
  },
  {
    "name": "Alberni Fitness Centre Ltd.",
    "category": "Fitness and Wellness Center",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-fitness-centre-ltd",
    "email": "",
    "description": "Alberni Fitness Centre Ltd. offers a fully equipped health and fitness center with cardio machines, spin bikes, free-weights, bodybuilding machines, free-motion fitness equipment, and more. They also provide heated infrared yoga, cool yoga classes, infrared saunas, suntan beds, instructor-led classes, massage, and alternative therapies."
  },
  {
    "name": "Alberni Liquor Store",
    "category": "Liquor Store",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-liquor-store",
    "email": "",
    "description": "Alberni Liquor Store offers a large variety of special in-store deals on boutique wines, craft beer & cider and spirits. Delivery service to all areas of Port Alberni, including Beaver Creek and Sproat Lake! Huge Cold Zone."
  },
  {
    "name": "Alberni Industrial Marine Supply Ltd. - RPM Group",
    "category": "Marine Supply Store",
    "address": "Kingsway Ave, Port Alberni",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-industrial-marine-supply-ltd-rpm-group",
    "email": "",
    "description": "Alberni Industrial Marine Supply, another founding member of RPM group, stands as an indispensable institution, renowned for the DIY fibreglass repair center, a wide range of fasteners, and hardware like stainless, galvanized, and grade 8 nuts & bolts, etc. This marine supply store offers a great selection of rope sold per foot or full roll. From electrical and plumbing supplies to paint, rigging hardware, pumps, raingear, PFDs (Personal Flotation Devices), and more, we have covered you for all your marine needs."
  },
  {
    "name": "Abell Pest Control Inc.",
    "category": "Pest Control",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/abell-pest-control-inc",
    "email": "npoirier@abellgroup.com",
    "description": "Since 1924, Abell Pest Control has provided quality services, protecting our customers and their patrons from coast-to-coast. Our customers enjoy the expertise and resources of a national provider. We are reliable experts in pest control—experts who care."
  },
  {
    "name": "Alberni District Fall Fair",
    "category": "Annual Agricultural Fair",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-district-fall-fair",
    "email": "",
    "description": "Port Alberni Annual Agricultural Fall Fair. 4H, logger sports, exhibits, food court, tractor pulls and mid-way excitement. The Fall Fair is all about food, fun and entertainment."
  },
  {
    "name": "A Step Above Cafe",
    "category": "Cafe",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/step-above-cafe",
    "email": "",
    "description": "Upstairs in seven Quality Foods stores you’ll find captivating cookware, gripping gadgets, divine decorative accessories and much more from brands including All-Clad, Cuisinart, Dualit, Emile Henry, Emma Bridgewater, KitchenAid, Le Creuset and Riedel. We also have a great selection of practical kitchen tools and gadgets to meet your everyday needs. A Step Above invites you to step upstairs to relax and take a break from shopping. We proudly brew delicious Starbucks Coffee, which goes perfectly with one (or two!) of our sumptuous baked treats. Whether you're treating yourself or buying gifts for family & friends, head over to A Step Above. You’ll find us on the upper mezzanine at Quality Foods, just above Perk Avenue. We're at select locations; Qualicum Beach, Courtenay, Powell River, Harewood & View Royal, with limited stores at Port Alberni and Comox."
  },
  {
    "name": "ADSS Career Centre",
    "category": "Career Centre",
    "address": "Alberni District Secondary School, Main Floor",
    "phone": "250-723-1191",
    "website": "https://albernichamber.ca/directory/adss-career-centre",
    "email": "gfreethy@sd70.bc.ca, nparmar@sd70.bc.ca, smanhas@sd70.bc.ca",
    "description": "The Career Centre is located just down the hall from the main office at Alberni District Secondary School. It offers various programs including Apprenticeship Programs, Dual Credit Programs with North Island College, Work Experience opportunities, Graduation Transitions, and more."
  },
  {
    "name": "Alberni Cannabis Store",
    "category": "Cannabis Dispensary",
    "address": "Port Alberni, Vancouver Island",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-cannabis-store",
    "email": "",
    "description": "Alberni Cannabis is a small family-owned licensed Port Alberni Cannabis Dispensary on beautiful Vancouver Island, right on the hub of the Pacific Rim. Alberni Cannabis is your source for high quality cannabis dried flower, CBD oil, and other cannabis concentrates."
  },
  {
    "name": "Alberni Golf Club",
    "category": "Golf Club",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-golf-club",
    "email": "",
    "description": "The Alberni Golf Club is a 6,242-yard, par 70 course located in the Alberni Valley at the hub of the Pacific Rim. Nestled amongst the evergreens under the ever watchful presence of Mount Arrowsmith, this golfer's jewel follows the contours of a salmon bearing stream which comes into play on several holes and also makes its annual contribution to the world’s salmon capital, Port Alberni. This traditional golf course has a rich history extending back to the 1920’s. While there have been many improvements to the course over the years you can nevertheless feel the spirit of those who have roamed the fairways before you. There is ample enjoyment and challenge for golfers of all skill levels. Guests are always welcome to stop by and play a round with Mother Nature.\n\n- 18 hole championship golf course\n- Picturesque setting\n- Dining room and licensed lounge\n- Banquet facilities\n- Open all year\n- Visitors always welcome\n- Practice facilities and covered driving range\n- The course is 6232 yards, par 70\n- Fully stocked pro shop with power cart and club rentals"
  },
  {
    "name": "Alberni Power & Marine - RPM Group",
    "category": "Boat Dealership",
    "address": "",
    "phone": "",
    "website": "https://www.albernipowermarine.com",
    "email": "",
    "description": "Alberni Power & Marine is one of the largest boat dealerships on Vancouver Island, offering a wide selection of boats, marine electronics, and services backed by over 32 years of industry experience."
  },
  {
    "name": "Alberni Adventure Gear",
    "category": "Equipment Rentals",
    "address": "Port Alberni, Vancouver Island",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-adventure-gear",
    "email": "",
    "description": "At Alberni Adventure Gear, we make it easy to explore Vancouver Island without the hassle of packing it all. We rent high-quality, ready to go gear bundles for camping, beach days, and family travel."
  },
  {
    "name": "4VI Group",
    "category": "Social Enterprise",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "4VI is a social enterprise created to ensure travel is a force for good — forever. Headquartered on Vancouver Island, we take a holistic approach to our work through the use of four pillars of social responsibility: businesses, communities, culture, and the environment. As strategic tourism advisors, we align our efforts with the values of the communities we serve, providing world-class public engagement, responsible marketing, visitor servicing, travel trade, travel media, and sustainable development support to our region in collaboration with our partners across the province. We also proudly provide regional destination management services for the Vancouver Island Region through a shared-cost agreement with Destination British Columbia. 4VI is the first destination management organization of its kind to not just commit to changing how tourism is managed, but to developing a corporate structure as a social enterprise to drive this much needed change."
  },
  {
    "name": "A V Little Digger & Hauler Ltd",
    "category": "Excavation Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/v-little-digger-hauler-ltd#main-content",
    "email": "",
    "description": "We are your premier destination for top-notch excavation services in the Alberni Valley, which includes Port Alberni and the surrounding areas. We are fully insured. We specialize in a wide range of services, including excavation for new landscapes, foundation digs, and perimeter drains."
  },
  {
    "name": "ADAPS Youth and Family Services",
    "category": "Non-profit organization",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/adaps-youth-and-family-services",
    "email": "",
    "description": "ADAPS Alberni Valley Youth and Family Services is a non-profit, charitable society that addresses social, health and environmental factors affecting youth and family wellness through education, intervention and treatment programs."
  },
  {
    "name": "Alberni Electric Ltd.",
    "category": "Electrical Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-electric-ltd#main-content",
    "email": "",
    "description": "Alberni Electric Ltd. specializes in reliable service, clear communication, and lasting results for residential and commercial electrical needs. Fully licensed, bonded, and insured, they have a strong reputation in the Alberni Valley and surrounding areas, focusing on attention to detail, clean job sites, and customer satisfaction. They are BBB Accredited and approved by Generac and CleanBC for backup power and energy efficiency solutions."
  },
  {
    "name": "Agrohope Farms & Products Inc",
    "category": "Seafood, Groceries",
    "address": "Port Alberni",
    "phone": "778-548-4313",
    "website": "https://albernichamber.ca/directory/agrohope-farms-products-inc#main-content",
    "email": "info@agrohope.ca",
    "description": "Agrohope Farms & Products Inc. is a premier provider of top-quality seafood sourced directly from Port Alberni and Vancouver Island, offering a range of non-traditional food, farm-fresh produce, and retail goods sourced from community farms and local businesses."
  },
  {
    "name": "Alberni Valley Employment Centre",
    "category": "Employment Services",
    "address": "",
    "phone": "",
    "website": "https://avemployment.ca/",
    "email": "",
    "description": "Alberni Valley Employment Centre provides free assistance and support to job-seekers in the Alberni-Clayoquot region of Vancouver Island, BC. They operate a full-time office in Port Alberni and two part-time offices in Ucluelet and Tofino, offering a variety of government funded services."
  },
  {
    "name": "Alberni Valley Childcare Society",
    "category": "Childcare",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-childcare-society",
    "email": "",
    "description": "We are a registered charitable not for profit society, and licensed childcare organization that has been offering programs and services to meet individual childcare needs since 1971. Our goal is to provide care, support and activities to develop each child’s individual independence and personal growth."
  },
  {
    "name": "AV Financial",
    "category": "Financial Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/av-financial",
    "email": "",
    "description": "AV Financial offers Financial Planning, Insurance, Group Benefits, Estate Planning, Income Tax Preparation, Accounting and Bookkeeping Services."
  },
  {
    "name": "Berry & Vale Contracting Ltd.",
    "category": "Landfill Services",
    "address": "",
    "phone": "",
    "website": "http://www.berryandvale.ca/services/excavating-trucking/",
    "email": "",
    "description": "Berry & Vale Contracting has been providing landfill services, specializing in the management of municipal BC landfill sites since 1980. They offer services such as large and small excavations, trucking services, site servicing, concrete removal, and demolition services."
  },
  {
    "name": "Alberni Valley Drag Racing Association",
    "category": "Drag Racing Association",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-drag-racing-association",
    "email": "",
    "description": "The Alberni Valley Drag Race Association strives to bring the sport of drag racing to the Alberni Valley and to increase opportunities for economic growth, cultural capital, volunteerism and destination tourism."
  },
  {
    "name": "Alberni Valley Curling Club",
    "category": "Sports & Recreation",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-curling-club",
    "email": "",
    "description": "Providing a sociable recreation opportunity for all persons of all ages, through the sport of curling at a reasonable cost. Come down and HURRY HARD!"
  },
  {
    "name": "Alberni Toyota",
    "category": "Car Dealership",
    "address": "Port Alberni",
    "phone": "(250) 723-9448",
    "website": "https://albernichamber.ca/directory/alberni-toyota",
    "email": "",
    "description": "Alberni Toyota offers a full selection of new Toyota vehicles and reliable pre-owned models, alongside quality auto maintenance and repairs. Their professional finance team assists with competitive financing or lease plans."
  },
  {
    "name": "Alberni Teens Can Rock",
    "category": "Non-Profit Music Performance School",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-teens-can-rock",
    "email": "",
    "description": "Alberni Teens Can Rock is a Music Studio Group originating from ADSS. The group has won awards all over Vancouver Island and can be found at most local events. They are exceptional! Enjoy!"
  },
  {
    "name": "Alberni Valley News",
    "category": "News",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-news",
    "email": "",
    "description": "The Alberni Valley News is a division of Black Press and has been serving the Alberni Valley and the West Coast for 10 years. The paper is published in Ladysmith, with 9,500 copies delivered every Wednesday, and is available to read online."
  },
  {
    "name": "B & A Transmissions Ltd.",
    "category": "Automotive Services",
    "address": "4521 10th Ave, Port Alberni, Vancouver Island",
    "phone": "250 724-9800",
    "website": "https://albernichamber.ca/directory/b-transmissions-ltd",
    "email": "",
    "description": "B&A Transmissions is Port Alberni’s only “Automatic Transmission Rebuilder Association” (A.T.R.A) Member offering over 60 years combined experience not just on transmission repair, but also standard transmissions, clutches, differentials, drive shafts and transfer cables. We provide professional service for all makes and model vehicles including motor homes of all sizes."
  },
  {
    "name": "Alberni Valley Refrigeration Ltd.",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-refrigeration-ltd",
    "email": "",
    "description": "Alberni Valley Refrigeration Ltd. provides top-notch heating and refrigeration service, emphasizing customer satisfaction and dedication. With over 25 years of experience, our team includes ticketed gas-fitters, refrigeration technicians, and sheet metal fabricators, ready to service your heating and cooling equipment."
  },
  {
    "name": "Alpha Home Inspections",
    "category": "Home Inspection",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alpha-home-inspections",
    "email": "",
    "description": "We assist buyers, sellers and owners in obtaining the necessary information to evaluate the present conditions of their property. An inspection of any kind of property works to your advantage, so please explore the materials here and then contact our office to schedule an inspection."
  },
  {
    "name": "Bare Bones Fish House & Smokery",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/bare-bones-fish-house-smokery",
    "email": "",
    "description": "A contemporary restaurant offering an innovative seafood and in house smoked meat driven menu. Our globally inspired 100% gluten free menu showcases a diverse range of fish, quality meats, tacos, burgers and bowls. Warm and inviting our spaces beauty and history are humbling."
  },
  {
    "name": "Belle's Haircare Boutique Salon",
    "category": "Hair Salon",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/belles-haircare-boutique-salon",
    "email": "",
    "description": "Belle's Haircare opened in November 2015 and has been offering its clients a professional, relaxing hair-only salon experience. The team is dedicated to staying up to date with the latest techniques and offers a variety of sustainable products. They are a Green Circle Certified Salon, committed to environmental responsibility."
  },
  {
    "name": "Alberni Valley Bulldogs Junior Hockey Club",
    "category": "Sports",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-bulldogs-junior-hockey-club",
    "email": "",
    "description": "The Alberni Valley Bulldogs are a proud member of the BCHL, providing opportunities for elite level athletes aged 16-20. They focus on both athletic and academic goals and have a strong commitment to community involvement."
  },
  {
    "name": "Alberni Valley Hospice Society",
    "category": "Nonprofit Organization",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-hospice-society",
    "email": "",
    "description": "The Alberni Valley Hospice Society sustains compassionate care and human dignity by providing support, education, and advocacy to individuals and their families facing life-limiting illness, death, and bereavement. We provide practical, emotional and spiritual support through all stages of illness and bereavement. In addition to our residential hospice, Ty Watson House, we also offer support to palliative clients in the community, as well as holistic health services, help with Advance Care Planning, and free grief support for adults, children, and youth."
  },
  {
    "name": "Animal Ark",
    "category": "Pet Store",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/animal-ark",
    "email": "",
    "description": "Animal Ark is Port Alberni’s ultimate destination for healthy and nutritionally balanced pet food. We offer a wide variety of quality raw diets, and nutritionally superb food, for pet parents to give to their animal family! You can always depend on our experience, knowledge and commitment toward providing you with exceptional animal care. Whether it's for your furry pets, aquarium food, reptile supply, frozen feeders, pet toys, accessories and live insects, we create an exciting environment for our valued customers pet shopping and service. We even have pets for adoption. Come by today and give your pets the care that they truly deserve!"
  },
  {
    "name": "Arrowvale Campground and Collins Farm",
    "category": "Campground and Farm",
    "address": "67 acre property along the Somass River, Vancouver Island, Alberni Valley",
    "phone": "250-720-7648",
    "website": "https://albernichamber.ca/directory/arrowvale-campground-and-collins-farm",
    "email": "halfacregardeners@gmail.com",
    "description": "Established in 1992, Arrowvale provides a safe, comfortable camping experience with scenic riverside camp-sites and two luxurious cedar cottages. The farm produces grass fed beef, local polyfloral honey, fresh pumpkins, and delectable Maple syrup seasonally."
  },
  {
    "name": "Alport Insurance",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alport-insurance",
    "email": "",
    "description": "Alport Insurance has been serving the Alberni Valley since 1986 and has helped thousands of customers since first opening their doors. Our brokers act as the ‘middle man’ between the insurance companies and the customer – always with the customer’s best interest in mind. Alport Insurance is staffed by a team of experienced professionals who make every effort to stay on top of the changing and competitive insurance industry. Continuing education and knowledge of the insurance marketplace is a key advantage that our brokers have over the competition. We know that the true value of an insurance policy is when you have a claim. Our insurance broker’s first concern is to make sure that you’re properly protected so that in the event of a loss, you’re covered. We strive to offer you the best customer service not only during these claims but throughout the year. In the era of technology and convenience, you can buy insurance online or over the phone. But the value of having the advice and assistance of an insurance broker, who will take the time to understand your needs is truly invaluable. Our brokers know that insurance is about building relationships and therefore are happy to communicate with you in whatever way you prefer: e-mail, phone, or in person."
  },
  {
    "name": "AV Home Check",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/av-home-check",
    "email": "",
    "description": ""
  },
  {
    "name": "Alberni Valley CrossFit",
    "category": "CrossFit Gym",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/alberni-valley-crossfit#main-content",
    "email": "",
    "description": "Alberni Valley CrossFit is a community-focused gym that emphasizes inclusivity, personal growth, and shared experiences through fitness. They provide challenging and fun workouts tailored to help members reach their goals while fostering a strong community spirit."
  },
  {
    "name": "BeaufortBooks",
    "category": "Accounting/Bookkeeping",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/beaufortbooks#main-content",
    "email": "",
    "description": "We help small businesses by acting as their integrated accounting team. Providing bookkeeping, accounting, payroll, compliance filing, financial reporting services and more, we handle the numbers and recordkeeping, allowing you to focus on your business and its goals."
  },
  {
    "name": "Artis Orthotics",
    "category": "Orthotics",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/artis-orthotics",
    "email": "",
    "description": "Artis Orthotics is a fully mobile orthotic business that offers personalized, medically-prescribed orthotic treatments in the comfort of your home or community. We provide custom-made and customized off-the-shelf solutions. The services we provide include: foot orthoses, ankle foot orthoses, knee bracing, orthopedic footwear, upper limb orthoses, spinal orthoses, fracture & trauma bracing and athletic bracing. Inspired by a family legacy of support for persons with disabilities, Artis Orthotics seeks to elevate the standard of orthotic treatment and services for Vancouver Island residents through a focus on innovation, accessibility, education, and evidence-based practice. Artis' community-first approach brings orthotic treatment services directly into areas of Vancouver Island that have historically suffered from poor service coverage. At Artis Orthotics, we take care of the distance, so you can get back to your life."
  },
  {
    "name": "Best Bed & Breakfast",
    "category": "Bed & Breakfast",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/best-bed-breakfast",
    "email": "",
    "description": "The Best Bed & Breakfast B&B providing safe, clean & cozy accommodations for tourists, families, senior groups & RCMP. Open year round."
  },
  {
    "name": "Alberni Valley Lions Club",
    "category": "Community Service",
    "address": "4277 Stamp Avenue, Port Alberni, British Columbia V9Y 7X8",
    "phone": ",",
    "website": ",",
    "email": ",",
    "description": "The Alberni Valley Lions Club meets on the second and fourth Tuesdays at 6:30 pm socially, with the formal meeting starting at 7:00 pm. Temporarily, meetings are held via Zoom on the second Tuesday and face-to-face on the fourth Tuesday."
  },
  {
    "name": "Bob Kanngiesser",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/bob-kanngiesser",
    "email": "",
    "description": "Retired Secretary Treasurer of the School District"
  },
  {
    "name": "Bute Street Veterinary Clinic Ltd.",
    "category": "Veterinary Clinic",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/bute-street-veterinary-clinic-ltd",
    "email": "",
    "description": "Veterinary Clinic, retails pet foods & pet supplies."
  },
  {
    "name": "City Of Port Alberni",
    "category": "Government organization",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/city-port-alberni",
    "email": "",
    "description": "A vibrant waterfront community at the heart of the West Coast!"
  },
  {
    "name": "Port Boat House",
    "category": "Community Member",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/bob-cole",
    "email": "",
    "description": "Bob Cole, a lifelong resident of the Alberni Valley known for his commitment to the community through the Chamber of Commerce and as a successful business owner of Port Boat House, where he achieved top Yamaha sales in Canada. He has received multiple Chamber Awards, including Volunteer of the Year."
  },
  {
    "name": "Business Development Bank",
    "category": "Financial Institution",
    "address": "",
    "phone": "",
    "website": "https://bdc.ca",
    "email": "",
    "description": "BDC is a financial institution devoted to Canadian entrepreneurs, supporting small and medium-sized businesses through financing and advisory services."
  },
  {
    "name": "Boomerangs Cafe",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/boomerangs-cafe",
    "email": "",
    "description": "Welcome to Boomerangs. We are a locally owned, family run restaurant. It is our pleasure to offer you a little taste of Australia, along with some of your old favorites."
  },
  {
    "name": "Chapel of Memories Funeral Directors",
    "category": "Funeral Services",
    "address": "Corner of 6th Avenue and Maitland Street, Port Alberni, Vancouver Island",
    "phone": "",
    "website": "https://albernichamber.ca/directory/chapel-memories",
    "email": "",
    "description": "Chapel of Memories Funeral Directors has provided funeral and cremation services for the Alberni Valley and surrounding communities since the early 40s. Their facility features a large chapel, family room, and accommodating parking."
  },
  {
    "name": "Chims Motel",
    "category": "Motel",
    "address": "Hwy 4, Port Alberni",
    "phone": "",
    "website": "https://albernichamber.ca/directory/chims-motel",
    "email": "",
    "description": "Chims Motel offers one bedroom accommodations with full size kitchens, ideal for personal getaways and corporate stays."
  },
  {
    "name": "BMO Bank of Montreal",
    "category": "Banking",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/bmo-bank-montreal",
    "email": "",
    "description": "As the 8th largest bank in North America by assets, we provide personal and commercial banking, wealth management, and investment services to more than 12 million customers. We focus on driving performance and fostering an inclusive society through our Zero Barriers to Inclusion 2025 strategy."
  },
  {
    "name": "Brie and Barrel",
    "category": "Bistro",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/brie-and-barrel",
    "email": "",
    "description": "An intimate bistro serving flavourful and unique dishes. Featuring local ingredients and products where ever possible. We carry a wide variety of wines and a full list of Vancouver Island Spirits, craft beer, and more."
  },
  {
    "name": "Black Dog Fencing",
    "category": "Fencing Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/black-dog-fencing",
    "email": "",
    "description": "Security, safety, decorative, private and public fencing installations, repairs and services for all local and surrounding areas. Versatile applications for every project. A team of professionals with the experience to take on the largest and smallest projects, ranging from commercial applications to residential properties. Contact us for more info."
  },
  {
    "name": "Cedar Wood Lodge Bed & Breakfast Inn",
    "category": "Bed & Breakfast",
    "address": "Port Alberni, BC, Canada",
    "phone": "",
    "website": "https://albernichamber.ca/directory/cedar-wood-lodge-bed-breakfast-inn",
    "email": "",
    "description": "The Alberni Valley's finest accommodation, serving business and leisure travelers alike with exceptional value in elegant surroundings. Cedar Wood Lodge, built in 1998, is furnished with modern comforts and beautiful antiques. Offers 8 guestroom suites featuring deluxe queen beds, private en-suite bathrooms with jetted massage tubs, and amenities like FREE WIFI, HDTV, and DVD movies."
  },
  {
    "name": "Best Western Plus Barclay Hotel",
    "category": "Hotel",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/best-western-plus-barclay-hotel",
    "email": "",
    "description": "The BEST WESTERN PLUS Barclay Hotel is located in the beautiful Alberni Valley. Recently renovated, this 84 room hotel is also a fully equipped Conference Centre. Come in and enjoy our Stamps Cafe, Pastimes Sport Bar & Grill, Beer Wine and Liquor Store."
  },
  {
    "name": "CBI Health",
    "category": "Healthcare",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/cbi-health",
    "email": "",
    "description": "CBI Health offers physiotherapy and rehabilitation therapy services to clients in Port Alberni and surrounding areas. They provide a wide range of services including ICBC, Worksafe BC, Private, MSP, and various extended health options. The clinic focuses on improving the physical and mental health of clients to aid in their recovery."
  },
  {
    "name": "Char's Landing Hall & Hostel",
    "category": "Hostel, Guesthouse",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Char's Landing is located right in the heart of Port Alberni's Uptown Art District. This beautiful century old former church building was purchased in 2010 by Charlene Patterson whose vision and hard work turned it into a public house hosting many community events and accommodating a multitude of travelers. Char's Landing Hostel has 3 bedrooms with 4 single bunk beds and a full private bathroom. Shared kitchen & laundry, TV room & Dining room, with free high speed WiFi and Ethernet jack. Pet friendly on request, plenty of free parking. Char's Landing Guesthouse is a private living area that accommodates up to 10 with full amenities. We offer hall rentals for various events and have hosted over 100+ touring musicians since 2010."
  },
  {
    "name": "Clam Bucket Restaurant",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/clam-bucket-restaurant",
    "email": "",
    "description": "Clam Bucket is a world famous seafood restaurant located at the heart of beautiful Port Alberni. The staff of the Bucket prides themselves on delivering the tastiest meals on the West Coast as well as providing the utmost in customer service. Don’t forget to make us a part of your “Bucket” list this week!"
  },
  {
    "name": "China Creek Campground",
    "category": "Campground",
    "address": "China Creek Campground, Port Alberni, Vancouver Island, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/china-creek-campground",
    "email": "",
    "description": "Our campground features 250 full and partial service tent and RV sites with forest or beach views, children’s playground, washrooms, showers, and laundry facilities. Beautiful views of the Alberni Inlet, a large south facing quiet natural beach, some of the best fishing on Vancouver Island and nearby access to the world class Alberni Inlet Trail. Eco-adventures at your doorstep; it’s an ideal spot to explore, relax and reconnect with friends and family by land and sea."
  },
  {
    "name": "Broken Islands Lodge",
    "category": "Lodge",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/broken-islands-lodge",
    "email": "",
    "description": "Broken Islands Lodge is Canada's Premier West Coast Kayaking experience. Located in Barkley Sound just half a mile from Pacific Rim Park and the Broken Group Islands. Remote and remarkable, experience Eco Tourism with the comforts of home. Accessible only by water, the lodge provides its guest with a truly unique, off-grid immersion experience. Guests are encouraged to unplug from their day-to-day and recharge in the fresh ocean air. Our nineteen bright and clean guest rooms will provide you with a place to relax and get a good night sleep in comfort. A variety of room options are available and able to accommodate one through four people per room. Each room contains its own personal sink and optional daily housekeeping is available. Washrooms and showers are a short walk down the hall and a fridge for guests is located in one of the 3 lounges. A selection of beer and wine is available for purchase during your stay as well as enjoy meals made from scratch with fresh ingredients. Plenty of salads and delicious desserts ensure that there is something for everyone to enjoy. You are also welcome to bring your own snacks and beverage."
  },
  {
    "name": "Boston Pizza",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/boston-pizza",
    "email": "",
    "description": "BPI is Canada’s number one casual dining brand. The Boston Pizza brand has served communities from coast-to-coast for over 56 years since opening its first restaurant in Edmonton, Alberta in 1964. Boston Pizza proudly remains a Canadian company with its hundreds of local franchise owners operating more dining rooms, sports bars and patios than any other single brand in the country, along with take-out and delivery. BPI has been recognized as a Platinum Member of Canada’s 50 Best Managed Companies and has been a Franchisees’ Choice Designation winner for eight consecutive years."
  },
  {
    "name": "The Card Corner & Games",
    "category": "Gift Shop, Games/Toys, & Board Games",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/card-corner-and-games",
    "email": "",
    "description": "The Card Corner & Games is a Vancouver-Island based hobby store specializing in Magic the Gathering, Board Games, Card Games, Dungeons & Dragons, Warhammer, Pokémon, Yu-gi-oh & gaming accessories. The Card Corner & Games can also special order many gaming products and accessories to cater to your needs."
  },
  {
    "name": "Clarkstone & Dearin Notary Corporation",
    "category": "Notary Public",
    "address": "",
    "phone": "(250) 723-9747",
    "website": "https://albernichamber.ca/directory/clarkstone-dearin-notary-corporation",
    "email": "",
    "description": "Dorothy Clarkstone has provided legal services to the Alberni Valley for 25 years. In 2016, Matthew Dearin partnered with Dorothy and they formed Clarkstone & Dearin Notary Corporation. As Notary Publics, we practice in non-contentious areas of law, such as Real Estate Conveyancing, Wills and Estate Planning, and Personal (Incapacity) Planning. The team at Clarkstone & Dearin Notary Corporation are ready to help you."
  },
  {
    "name": "Catalyst Port Alberni - A Paper Excellence Company",
    "category": "Manufacturing",
    "address": "Located at the head of picturesque Alberni Inlet, British Columbia",
    "phone": "",
    "website": "https://albernichamber.ca/directory/catalyst-port-alberni-paper-excellence-company",
    "email": "",
    "description": "Catalyst Port Alberni Mill is the single largest employer in the community, committed to environmental sustainability, producing telephone directory, lightweight coated, and specialty papers for markets across North America, South America, and Asia."
  },
  {
    "name": "Cherry Creek Cidery",
    "category": "Cider",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Cherry Creek Cidery is owned by basement brewmasters, Jen and Owen. We produce locally sourced cider that supports farms and farmers from the Alberni Valley and throughout the Province. We do not have an onsite store but are happy to serve everyone through online sales and community liquor stores."
  },
  {
    "name": "Chances RimRock Entertainment",
    "category": "Entertainment",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/chances-rimrock-entertainment",
    "email": "",
    "description": "At Chances RimRock we like to believe we can showcase the beauty and magic of the west coast rainforest to our guests in an unexpected indoor environment. From the towering 1500-year-old cedar trees to the massive Douglas firs, we have incorporated every species of wood found in the coastal rainforest in our indoor decor. We invite you to explore our 28,000 sq foot facility, travel down any of the forest paths and discover a new game at our gaming centre or a delightful meal at Cypress Restaurant."
  },
  {
    "name": "Canadian Tire",
    "category": "Retail",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/canadian-tire",
    "email": "",
    "description": "Boldly shaping retail in Canada. For almost a century, we’ve proudly offered products and services to help Canadians with the jobs and joys of life in Canada. Today, our network of 1,700 retail locations couldn’t be stronger and our staff, more connected to the communities they serve. \n\nServing Canadians since 1922, Canadian Tire is your home for all the everyday things that can help you work, play, and live better. Canadian Tire's Jumpstart Program is more than just about getting kids active. It's about giving kids from families in financial need the same chance to participate as their neighbours, their classmates and their friends. \n\nOur Mission: To enrich the lives of kids in need through sport and physical activity. Our Vision: Canada, where all kids have a chance to fulfill their dreams."
  },
  {
    "name": "Coastal Community Credit Union",
    "category": "Financial Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/coastal-community-credit-union",
    "email": "",
    "description": "Coastal Community Credit Union is the largest Vancouver Island-based financial services organization, providing personal, business and commercial banking services for over 70 years."
  },
  {
    "name": "Don Woodfin Log Transport",
    "category": "Transport",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/don-woodfin-log-transport",
    "email": "",
    "description": "Don Woodfin Log Transport provides log transport services."
  },
  {
    "name": "Coleman RV and Campground",
    "category": "Camping",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/coleman-rv-and-campground",
    "email": "",
    "description": "Coleman RV & Campground features 34 Riverside spots. Dry camping available with flush toilets and a shower. Riverfront location perfect for relaxing and enjoying scenery, with fishing available in season."
  },
  {
    "name": "Community Futures Alberni Clayoquot",
    "category": "Non-profit Organization",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/community-futures-alberni-clayoquot",
    "email": "",
    "description": "Community Futures is a non-profit organization guided by a volunteer Board of Directors and staffed with business professionals. We work with community partners to help foster entrepreneurship and economic development in our region. It provides financing alternatives to small and medium enterprises, focusing on rural development."
  },
  {
    "name": "D & D Clean Exteriors Ltd.",
    "category": "Exterior Cleaning Services",
    "address": "",
    "phone": "",
    "website": "https://cleanexteriors.ca",
    "email": "",
    "description": "D & D Clean Exteriors Ltd. provides professional roof moss removal and a variety of exterior cleaning services designed to protect your home or business investment."
  },
  {
    "name": "CMHA-Port Alberni",
    "category": "Mental Health Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/cmha-port-alberni",
    "email": "",
    "description": "CMHA-PA is a local, independent, accredited, multi service society, located on the traditional territories of the Hupacasath and Tseshaht First Nations. We are proud to offer a variety of services and programs to support our community. We strive to assist members with mental health issues and work to lessen the stigma associated with mental illness."
  },
  {
    "name": "Connect Hearing",
    "category": "Hearing Clinic",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/connect-hearing",
    "email": "",
    "description": "At Connect Hearing we bring together the best hearing professionals in Canada with the most advanced hearing technology. We believe every sound connects us to our world. Meet with Audiologists & Hearing Instrument Specialists at our hearing clinic in Port Alberni. We offer free hearing evaluations, the most advanced hearing aids, maintenance & aftercare."
  },
  {
    "name": "Cypress Restaurant & Lounge",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Innovative menu of fine West Coast dining with superb service in an intimate setting. Features a 500 year old fireplace."
  },
  {
    "name": "Eagle's Nest Restaurant",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/eagles-nest-restaurant",
    "email": "",
    "description": "Casual and friendly hospitality are the norm for the Alberni Golf Club Restaurant staff, and our menu offers “clubhouse” fare with daily features that offer a bit more adventure and further enhance your dining experience."
  },
  {
    "name": "Coleman Meadows Farm",
    "category": "Farm",
    "address": "Coleman Road, Alberni Valley",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Coleman Meadows Farm is a mix of gardens, forage, pasture, forest and streams supporting Coho salmon. It features two farm businesses: Coleman Meadows Farm (Water Buffalo Dairy) and Dyson Dairy (Jersey’s and cow dairy). The farm sells water buffalo products including cheese and meat, and is known for its Water Buffalo Gelato."
  },
  {
    "name": "Dewayne Parfitt",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/dewayne-parfitt",
    "email": "",
    "description": "Former Board Member at McLean Mill National Historic Site."
  },
  {
    "name": "Community Arts Council of the Alberni Valley",
    "category": "Arts and Culture",
    "address": "Harbour Quay",
    "phone": "",
    "website": "https://alberniarts.com",
    "email": "info@alberniarts.com",
    "description": "The Community Arts Council of the Alberni Valley operates the Grove Gallery at the Harbour Quay, hosting monthly exhibitions, selling local artwork, and organizing workshops and events. Established in 1965, it aims to enhance community life through arts promotion and education."
  },
  {
    "name": "Comox Valley Airport (YQQ)",
    "category": "Airport",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/comox-valley-airport-yqq",
    "email": "",
    "description": "YQQ serves passengers from central and northern Vancouver Island with its daily direct flights to/from Calgary, Edmonton, Kelowna and Vancouver onboard WestJet, Air Canada and Pacific Coastal Airlines."
  },
  {
    "name": "Cloud City Apparel Co.",
    "category": "Clothing and Lifestyle",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/cloud-city-apparel-co#main-content",
    "email": "",
    "description": "Cloud City Apparel Co. is a clothing and lifestyle store inspired by the community and natural beauty of Vancouver Island. We design and hand-print our own line of apparel as well as carry a broad range of other local and complimentary brands and products."
  },
  {
    "name": "Coombs Country Candy",
    "category": "Food & Beverage",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/coombs-country-candy",
    "email": "",
    "description": "Coombs Country Candy is Vancouver Island's Sweetest Secret. Come inside and see how we craft some of the finest chocolates, candies, frozen treats and more. All our products contain natural ingredients and we carefully make our products by hand in-store, all for you! Visit us in-store for a wide selection of specialty seasonal items."
  },
  {
    "name": "Denis Francoeur Backhoeing Ltd.",
    "category": "Excavation Services",
    "address": "",
    "phone": "",
    "website": "https://www.we-dig-it.net",
    "email": "",
    "description": "Denis Francoeur Backhoeing Ltd provides expert service in ditching, asphalt cutting, drainage, hauling, demolition, and snow removal. They promise professional and affordable excavation service, working with clients to provide the exact service needed at a competitive price."
  },
  {
    "name": "Cokely Wire Rope Ltd.",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/cokely-wire-rope-ltd",
    "email": "",
    "description": "Cokely Wire Rope Ltd. was established in 1978 in Port Alberni. This company has a group of individuals who are knowledgeable about the products they carry and understand the needs of the customers. As a group we have many years of experience in the logging, marine, crane, sawmill and industrial businesses. Our understanding of our customers allows us to gear our products and services to meet specific needs and provide solutions to all customers' requirements. Being professional means a lot to our customers and they know they can depend on us to get them what they need when they need it. We carry a full line of domestic and import products. All products are purchased based on our own criteria and carry mill certificates if requested."
  },
  {
    "name": "Dog Mountain Brewing",
    "category": "Breweries",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/dog-mountain-brewing",
    "email": "",
    "description": "We are Dog Mountain Brewing, serving great beer and tasty food on our GIANT rooftop patio"
  },
  {
    "name": "Clydesdale Automotive Ltd.",
    "category": "Unknown",
    "address": "",
    "phone": "250 720-3836",
    "website": "https://albernichamber.ca/directory/clydesdale-automotive-ltd",
    "email": "",
    "description": "At Clydesdale Automotive our experienced technicians repair all makes and models of cars and light trucks. We also have fully certified auto technicians on staff to provide maintenance and repairs. As a family owned and operated business since 2010, we strive to provide top-quality services at affordable prices and we have over 60 years of experience in the industry. From diesel repair to performance upgrades to tune-ups, count on us for a job well done. Call us for your free estimate today!"
  },
  {
    "name": "De Vries Fine Woodworking Inc.",
    "category": "Custom Cabinetry",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/de-vries-fine-woodworking-inc#main-content",
    "email": "",
    "description": "Expertly crafted custom cabinetry that perfectly matches your style and needs. De Vries Fine Woodworking is a premier custom cabinetry and millwork company based in Port Alberni, BC. We are dedicated to creating beautiful, functional, and high-quality cabinetry solutions for our clients. We specialize in creating custom kitchen cabinets, bathroom cabinets, closets and storage solutions, custom millwork, and commercial cabinetry."
  },
  {
    "name": "Edward Jones",
    "category": "Financial Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/edward-jones",
    "email": "",
    "description": "Edward Jones is a full service financial advising and investment brokerage, offering services such as cash management, dividend paying equity and bond portfolios, and insurance."
  },
  {
    "name": "Coleman Road Shingle Mill",
    "category": "Manufacturer",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/coleman-road-shingle-mill#main-content",
    "email": "",
    "description": "Manufacturer of cedar shingles and shakes"
  },
  {
    "name": "Elite Dance Academy",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/elite-dance-academy#main-content",
    "email": "",
    "description": "Elite Dance Academy is a vibrant, family-centered studio dedicated to inspiring a love of dance in students of all ages and abilities. With highly qualified faculty, a supportive environment, and programs ranging from recreational classes to advanced training, we help dancers grow in confidence, artistry, and discipline. Our mission is to provide quality dance education in a positive and age-appropriate way, while building community, creativity, and a lifelong appreciation for the performing arts."
  },
  {
    "name": "Driftwood Restaurant",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/driftwood-restaurant",
    "email": "",
    "description": "DRIFTWOOD RESTAURANTS (formerly Golden Dragon here in PA) is a chain of Vancouver Island-owned restaurants featuring fresh, hand-crafted Chinese food, local beers and we’re famous for our All-You-Can-Eat Buffets. Founded in Campbell River, we have expanded to, and are currently operating additional locations in Port Alberni, Parksville and Nanaimo. We offer a full bar and feature local beers in each of our locations. Each restaurant is a little bit different and is influenced by the flavor of the community we’re located in. Come try our fantastic food, wonderful service, and our warm hospitality."
  },
  {
    "name": "Compass Mobile Therapeutics",
    "category": "Mobile Registered Massage Therapy",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/compass-mobile-therapeutics#main-content",
    "email": "",
    "description": ""
  },
  {
    "name": "Jack Roland",
    "category": "Real Estate",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/jack-roland#main-content",
    "email": "",
    "description": "A new Real Estate agent to the Port Alberni Valley"
  },
  {
    "name": "Immediate Images Inc.",
    "category": "Digital Signage Solutions",
    "address": "",
    "phone": "",
    "website": "https://immediateimages.com/footprint.html",
    "email": "",
    "description": "Immediate Images Inc. digital signage solutions connect you to your audience just when they need you the most."
  },
  {
    "name": "Hospitality Inn",
    "category": "Hotel resort · Motel",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/hospitality-inn",
    "email": "",
    "description": "Hospitality Inn - Hemeed Khan"
  },
  {
    "name": "Finishing Touches",
    "category": "Esthetics, Accessories, Gifts",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/finishing-touches",
    "email": "",
    "description": "For over 40 years, the goal of Finishing Touches has been, and will continue to be, to provide you with the ultimate in total body relaxation through spa services provided by a professionally trained staff of unmatched experience."
  },
  {
    "name": "Gayle's Fashions",
    "category": "Fashion Boutique",
    "address": "Kingsway Crossing, Port Alberni, Vancouver Island, British Columbia, Canada",
    "phone": "/",
    "website": "https://albernichamber.ca/directory/gayles-fashions",
    "email": "/",
    "description": "Gayle's Fashions is a boutique-style ladies' wear shop in Port Alberni, known for its rich history and connection to the community. The shop was founded by Gayle Stephen-Player in 1983 and is now operated by her daughter, Rebecca Palmer. Offering a variety of fashion items, the store has evolved from a fitness studio to a local fashion icon."
  },
  {
    "name": "Hupacasath First Nation",
    "category": "First Nation",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/hupacasath-first-nation",
    "email": "",
    "description": "The Hupačasath First Nation people are a living history of the Alberni Valley. For thousands of years their people have instilled the importance of community here. Our mission is to enhance the quality of life for our people by creating a healthy and self-sufficient community through: Being fiscally responsible and increasing our own source revenue, Building community capacity, Building on existing partnerships and exploring new partnerships with local governments and businesses, Developing business opportunities that are built on traditional knowledge, community strengths and are based on the realities of the market."
  },
  {
    "name": "Iris the Visual Group",
    "category": "Optometry",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/iris-visual-group",
    "email": "",
    "description": "IRIS is the largest network of optometrists and opticians in Canada with a commitment to providing the highest quality products and professional services. Book your eye exam and our professionals will build a plan to improve your vision and to protect your eye health based on your health history, daily activities and budget. IRIS offers a large selection of prescription eyeglasses, sunglasses and contact lenses and we look forward to helping you select the perfect products so you will look and see your best!"
  },
  {
    "name": "Flandangles Kitchen & Gift",
    "category": "Kitchen and Gift Shop",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/flandangles-kitchen-gift",
    "email": "",
    "description": "Exclusive Distributor for Canadian Made PADERNO COOKWARE, offering small appliances, table ware, gourmet cooking accessories, quality knives, linens, coffee makers, baking items, BBQ accessories, and more."
  },
  {
    "name": "Fish and Duck Sproat Lake Resort",
    "category": "Resort",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/fish-and-duck-sproat-lake-resort",
    "email": "",
    "description": "The Fish & Duck on Sproat Lake is a family-run resort that offers houseboat holidays, boat rentals, non-motorized rentals, and on-site pub food."
  },
  {
    "name": "HFN Group of Businesses",
    "category": "Business Directory",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/hfn-group-businesses",
    "email": "",
    "description": "Huu-ay-aht Group of Businesses operates several businesses including forestry and tourism-based operations for the Huu-ay-aht First Nations on Vancouver Island."
  },
  {
    "name": "Graphics Factory, Printing & Signs",
    "category": "Printing & Signs",
    "address": "3157 2nd Avenue, Uptown Port Alberni",
    "phone": "",
    "website": "https://albernichamber.ca/directory/graphics-factory-printing-signs",
    "email": "",
    "description": "The Graphics Factory has been serving customers on Central Vancouver Island and beyond since 1989. Specializes in offset & digital printing, sign design, and production."
  },
  {
    "name": "Gone Fishin'",
    "category": "Fishing, Hunting, Outdoor Store",
    "address": "",
    "phone": "250-723-1172, 250-758-7726, 250-334-2007, 778-455-1414",
    "website": "https://albernichamber.ca/directory/gone-fishin",
    "email": "",
    "description": "We provide gear and services for freshwater, saltwater, fly fishing, hunting, and sport shooting as well as many other variations of outdoor sports."
  },
  {
    "name": "Island Express Bus Inc.",
    "category": "Transportation",
    "address": "",
    "phone": "",
    "website": "https://www.islandlinkbus.com",
    "email": "",
    "description": "IslandLink started in 1998 with bus service from Qualicum Beach, French Creek and Parksville to the Departure Bay Ferry Terminal, offering connectivity for foot passengers across multiple BC Ferries terminals."
  },
  {
    "name": "INEO Employment Counselling",
    "category": "Employment Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/ineo-employment-counselling",
    "email": "",
    "description": "Through the Employment Program of British Columbia, our case managers help you develop an employment plan that fits your needs and then supports you in achieving your employment goals. Our WorkBC Service Centre offers career/vocational counselling, job search and human resource support, resource area with a job board, advocacy and referrals to other agencies/programs, Life Skills and Employability Skills workshops and Self Employment Services for People with Disabilities."
  },
  {
    "name": "Foxy Box Laser and Wax Bar - Port Alberni",
    "category": "Beauty and Personal Care",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/foxy-box-laser-and-wax-bar-port-alberni",
    "email": "",
    "description": "YOUR #1 DESTINATION FOR THE QUICKEST, MOST EFFECTIVE, AND MOST FUN HAIR REMOVAL SERVICES ON THE MARKET. OUR MISSION IS TO LEAVE YOU FEELING ENERGIZED AND POWERFUL, SO YOU CAN CELEBRATE YOUR UNIQUENESS AND EMBRACE YOUR INNER FOX! Our masterful Vagicians are experts in the art of the Brazilian and we guarantee that our proprietary foxy technique can’t be beat. We provide superior services and are committed to dispelling the discomfort of hair removal by cultivating a warm and inclusive environment."
  },
  {
    "name": "Huu-ay-aht Government Office",
    "category": "First Nations Government",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/huu-ay-aht-government-office",
    "email": "",
    "description": "Huu-ay-aht First Nations is a self-governing, modern treaty Nation located in the Barkley Sound region on the west coast of Vancouver Island at the entrance to Alberni Inlet. The Nation operates under a Constitution and has full ownership of over 8,200 hectares of land due to the Maa-nulth Final Agreement."
  },
  {
    "name": "Innov8 Digital Solutions",
    "category": "Office Equipment, Digital Technology, IT Management",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/innov8-digital-solutions",
    "email": "",
    "description": "As Western Canada’s largest Canon dealer, Innov8 is the cumulation of several independent corporations that are now operating as one strong, customer-focused business. With a team of more than 60 people and 10 locations across British Columbia and Alberta, our independently owned and operated company provides customers with access to the latest leading brands, including Canon office equipment, digital technology, Managed IT, and skilled support."
  },
  {
    "name": "Grassroots Cafe Inc.",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/grassroots-cafe-inc#main-content",
    "email": "",
    "description": "Speciality coffees and locally grown healthy food served on the waterfront year round."
  },
  {
    "name": "Harbour Pharmacy",
    "category": "Retail Pharmacy",
    "address": "/",
    "phone": "/",
    "website": "https://albernichamber.ca/directory/harbour-pharmacy#main-content",
    "email": "/",
    "description": "A2A"
  },
  {
    "name": "Huu-ay-aht First Nations",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/huu-ay-aht-first-nations",
    "email": "",
    "description": ""
  },
  {
    "name": "Formula Photographic Inc.",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/formula-photographic-inc#main-content",
    "email": "",
    "description": "Formula Photographic Inc. is a video and digital media production company telling compelling stories of high performance people, teams, and machines as they push their limits. Warwick Patterson is a leader in story-driven documentary and adventure cinematography, and is also an advanced-licensed and insured drone pilot."
  },
  {
    "name": "eSafetyFirst Canada",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/esafetyfirst-canada",
    "email": "",
    "description": "eSafetyFirst Canada is a company founded in 2018 by Cosmin Rebegila, and it's now one of Canada's leading providers of online occupational health and safety training and services."
  },
  {
    "name": "Enex Fuels",
    "category": "Fuels",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/enex-fuels",
    "email": "",
    "description": "Welcome to Enex Fuels. We are the exclusive distributor of quality Esso branded fuels and Mobil lubricants on Vancouver Island. Enex is a 100% Vancouver Island owned and operated company that provides exceptional customer service. Whether you're a residential client looking for furnace oil, furnaces, unique payment plans, or a commercial client looking for delivered fuels, cardlock locations, or lubricants, we have everything you need. Our broad range of products meet and exceed the highest standards of today's industry.\n\nAt Enex, our commitment to our customers ensures we are able to fulfill all of your petroleum product needs. Our customer pledge is that your experience with Enex will be positive and unmatched anywhere in the industry. We believe in responsible and safe distribution of our products so that our customers get the very best products available."
  },
  {
    "name": "Island Cleaning Supplies",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/island-cleaning-supplies",
    "email": "",
    "description": "Island Cleaning Supplies has been a family owned and operated business since 1996! Since inception, our goal has been to provide you with the friendly, prompt, and professional service you deserve at a fair price. Today, we offer a selection of over 40,000 residential and commercial cleaning supplies making Island Cleaning Supplies & Vacuums the largest Island owned & operated cleaning product distributor on Vancouver Island. We are Proud to offer Premium lines like Tork paper and hand hygiene products, Tennant/Nobles equipment, Rochester Midland, Vileda professional, sanitaire, Beam, and Miele. We Provide delivery to the Port Alberni area every week."
  },
  {
    "name": "Full Circle Consultancy",
    "category": "Consultancy",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/full-circle-consultancy#main-content",
    "email": "",
    "description": "Providing consultancy services within the health, social, government, public, non-profit and Indigenous sectors across the Alberni Valley and BC. Services include strategic planning, program development, change management, project management, issues management, grant writing, and business development."
  },
  {
    "name": "Knuline Transportation",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/knuline-transportation",
    "email": "",
    "description": "Charter bus service for sports teams, weddings, corporate events, school groups, clubs and any one in need of passenger transportation."
  },
  {
    "name": "Living Forest Oceanside Campground and RV Park",
    "category": "Campground and RV Park",
    "address": "Nanaimo, British Columbia, Canada",
    "phone": "",
    "website": "https://albernichamber.ca/directory/living-forest-oceanside-campground-and-rv-park",
    "email": "",
    "description": "Living Forest Campground is a 53-acre park situated on a peninsula where the Nanaimo River meets the ocean, offering various camping sites including sunny, river-view, ocean-view, and secluded forest sites."
  },
  {
    "name": "McDonald's Restaurant",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mcdonalds-restaurant",
    "email": "",
    "description": "Since 1955, we've proudly served the world some of its favourite food. It's been an exciting journey, and we're just getting started."
  },
  {
    "name": "McGill and Associates Engineering Ltd.",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mcgill-and-associates-engineering-ltd#main-content",
    "email": "",
    "description": "We are dedicated to providing practical engineering solutions that satisfy our clients’ needs, timelines, and budgets through technical expertise, teamwork, and continual professional growth."
  },
  {
    "name": "LA Rain Tree Inc",
    "category": "Cleaning Services",
    "address": "",
    "phone": "250-735-8840",
    "website": "https://albernichamber.ca/directory/la-rain-tree-inc",
    "email": "",
    "description": "LA Rain Tree Inc, co-owned by Lorraine & Willow, offers cleaning services at offices, residential & commercial buildings, construction projects, and much more!"
  },
  {
    "name": "Live to Surf Inc.",
    "category": "Surf Shop",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/live-surf-inc",
    "email": "",
    "description": "We do surf lessons, retail, rental, and wholesale of surfing, bodyboarding, skateboarding, and skimboarding equipment. We carry a wide selection of hardgood and softgood products related to these sports and culture."
  },
  {
    "name": "LDG Electrical Limited",
    "category": "Electrical Services",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/ldg-electrical-limited",
    "email": "",
    "description": "LDG Electrical LTD offers a variety of electrical contracting services including new installations, assistance with renovations, and upgrades to electrical service panels. Services are provided in residential, commercial, and industrial areas including schools, restaurants, power and lighting, and motor control centers. Specialties include Fire Alarms, Surveillance, and Solar Panel installations."
  },
  {
    "name": "MNP LLP",
    "category": "Professional Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mnp-llp#main-content",
    "email": "",
    "description": "MNP is a proudly Canadian professional services firm offering a full suite of accounting, tax, consulting, financial advisory and digital services. Local in focus and national in scope, MNP’s professionals provide clear, straightforward business advice and personalized strategies to help your business or organization succeed at every stage."
  },
  {
    "name": "McLean Mill National Historic Site",
    "category": "Historic Site",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mclean-mill-national-historic-site",
    "email": "",
    "description": "The McLean Mill National Historic Site is a former sawmill and logging operation located in the Alberni Valley of Vancouver Island, British Columbia’s west coast. Designated in 1989, it commemorates significant aspects of the forest industry and offers a 24-stop signage program, rustic campground, and event facilities."
  },
  {
    "name": "L.B. Woodchoppers Ltd",
    "category": "Equipment Sales, Service, Rental, Clothing",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/lb-woodchoppers-ltd",
    "email": "",
    "description": "L.B. Woodchoppers Ltd. has been proudly serving the Alberni Valley and surrounding areas since Feb. 12, 1980. The first shop was not where the current store sits today. For the first two years of business the store was located on 4th Ave., very close to where the current location is. In 1982, L.B. Woodchoppers Ltd. made the move to what is now currently the L.B. Woodchoppers building."
  },
  {
    "name": "Jowsey's Furniture & Mattresses",
    "category": "Furniture & Mattresses",
    "address": "/",
    "phone": "/",
    "website": "http://www.jowseys.ca/?fbclid=IwAR1CcY8DIbFCKmnSmSyrEc80Mpc_wpIjVI6wbQlr1Bn50zyeAeZdX54u11A",
    "email": "/",
    "description": "Jowsey’s Furniture & Beds has been selling fine furniture and beds since 1947. Stylish and comfy furniture and beds delivered with great care into your home. Great prices, AMAZING service!"
  },
  {
    "name": "Little Bavaria Restaurant",
    "category": "Restaurant",
    "address": "/",
    "phone": "/",
    "website": "https://albernichamber.ca/directory/little-bavaria-restaurant",
    "email": "/",
    "description": "Little Bavaria Restaurant has specialized in German food and hospitality since 1966. Featuring the freshest of ingredients, our delicious cuisine is served in an intimate and cozy atmosphere by our friendly staff."
  },
  {
    "name": "McIntosh Norton Williams CGA's",
    "category": "Tax planning and wealth management",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mcintosh-norton-williams-cgas",
    "email": "",
    "description": "Tax planning and wealth management go hand-in-hand. After all, it's not what you earn, it's what you keep! When we prepare your tax returns we do so with an eye on not only reducing your taxes in the current year, but also on advising you how to reduce your taxes in the future. Also, you can contact us throughout the year with questions on how to save taxes or how to structure your affairs to minimize your tax and maximize your wealth."
  },
  {
    "name": "Literacy Alberni Society",
    "category": "Literacy and Education",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/literacy-alberni-society",
    "email": "",
    "description": "Literacy Alberni works to ensure we are leaders in providing literacy, education, language, and settlement services to our community. We provide educational programs and facilitate literacy acquisition in learners of all ages through a range of programs, services, and activities. We are committed to respecting, promoting, and advancing the values of equity, diversity, inclusion, and safety for all peoples."
  },
  {
    "name": "Kal Tire",
    "category": "Tires, Mufflers, Brakes, Alignments",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/kal-tire",
    "email": "",
    "description": "Founded by Tom Foord in 1953, and based in Vernon, BC, Kal Tire has expanded steadily and now employs more than 6,500 team members internationally. Our aim is to earn the trust of our customers by providing them with a level of quality and value of both service and products. Kal Tire is Canada’s largest independent tire dealer and one of North America’s largest commercial tire dealers with over 250 Kal Tire retail and commercial stores from British Columbia to Ontario, warehouse facilities and 10 retread manufacturing plants. In addition, Kal Tire’s Mining Tire Group is an international leader in mining tire service and supply, servicing more than 150 mine sites across five continents."
  },
  {
    "name": "Javen Simon Roofing",
    "category": "Roofing Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/javen-simon-roofing",
    "email": "",
    "description": "Javen Simon Roofing Ltd has been providing roofing installation and repair services to the Port Alberni area since 2007. We are driven to provide exceptional roofing services in the Alberni Area, ensuring reliability, efficiency, and a safe work environment, while meeting all current building codes and striving for above industry standards."
  },
  {
    "name": "Medix BC",
    "category": "First Aid Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/medix-bc",
    "email": "",
    "description": "Medix operates ambulances and transfer vehicles for non-emergent patient transfers, event first aid and industrial first aid throughout Vancouver Island and the Lower Mainland. Open in December of 2011 we have endeavored to set the industry standard for private transfer and first aid services. Now introducing first aid supplies, auditing services and a first aid room restocking service."
  },
  {
    "name": "Klubhouse for Kids",
    "category": "Baby & children's clothing shop, Games/Toys, Baby goods/Children's goods",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/klubhouse-kids",
    "email": "",
    "description": "Klubhouse for Kids has been Port Alberni's favourite children's Clothing & Toy store since 2003. We are a one stop shop for Baby shower & Birthday gifts for newborn to 8 years."
  },
  {
    "name": "Jim's Clothes Closet",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/jims-clothes-closet#main-content",
    "email": "",
    "description": "At Jim's Clothes Closet we have been dressing Vancouver Island Men for over 44 years. The reason for our success is that we understand men and how they like to shop. Whether you're a man who likes to take his time and look around or a guy who wants to be in and out as quick as possible, our knowledgeable staff will be there to help you out. Come visit one of our stores and see how we make shopping enjoyable."
  },
  {
    "name": "Magnolia Childcare Society",
    "category": "Childcare",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/magnolia-childcare-society",
    "email": "",
    "description": "Magnolia Childcare Society operates inclusive, family-focused early years Centres within the Alberni Valley, offering play-based learning through nature-focused experiences."
  },
  {
    "name": "Meals on Wheels",
    "category": "Not for profit charitable organization",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/meals-wheels",
    "email": "",
    "description": "Meals on Wheels Port Alberni promotes the dignity, health and independence of people who are elderly, have disabilities or are convalescing. Access to well-balanced, affordable meals is imperative to the independence and sustenance of Meals on Wheels clients. Research shows that healthy eating provides essential energy and nutrients for general welfare, maintenance of health and functional autonomy, and reduces the risk for chronic diseases at older ages."
  },
  {
    "name": "Jiffy Lube",
    "category": "Fluid Maintenance and Automotive Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/jiffy-lube",
    "email": "",
    "description": "Fluid Maintenance of cars and light trucks including Jiffy Lube Signature Service® Oil Change, Cooling System Services, Transmission Services, Engine Services, Serpentine Belt Replacement, Drivetrain Services, Differential Service, Transfer Case Service, Battery Maintenance Services, Light Bulb Inspection and Replacement, Air Filtration Services, and Fuel System Services."
  },
  {
    "name": "Metrix Appraisals Ltd.",
    "category": "Commercial Real Estate Appraisal Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/metrix-appraisals-ltd#main-content",
    "email": "",
    "description": ""
  },
  {
    "name": "Lady Rose Marine Services",
    "category": "Marine Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/lady-rose-marine-services",
    "email": "",
    "description": "Take a ride on the MV Frances Barkley for a day to escape the fast pace of life and enjoy the tranquility of the West Coast. Scan the shores for black bears and eagles, look out over the water and see if you can't spot a seal or some whales. You'll have some great opportunities to take pictures. On deck, you are able to watch the crew as they unload freight for the residents and visitors of Barkley Sound. We deliver everything from lumber to washing machines to groceries to even livestock."
  },
  {
    "name": "Limitless Automation Company",
    "category": "Automation",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/limitless-automation-company#main-content",
    "email": "",
    "description": "Welcome to Limitless Automation. We're not your typical automation company. We're the architects of efficiency and champions of success. From cutting-edge tech to innovative approaches, we supercharge workflows. We transform the mundane into the extraordinary. Join us where productivity meets passion. With Limitless Automation, we're Uniting the World, One Automation at a Time."
  },
  {
    "name": "Pastimes Sports Bar & Grill",
    "category": "Sports Bar & Grill",
    "address": "Best Western Plus Barclay Hotel, Port Alberni, Canada",
    "phone": "",
    "website": "https://albernichamber.ca/directory/pastimes-sports-bar-grill",
    "email": "",
    "description": "Try some of our Pastimes feature items at our Port Alberni hotel restaurant during the game. After a busy day exploring, greet the evening with one of our tempting cocktails."
  },
  {
    "name": "Names and Numbers",
    "category": "Local Business Directory",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/names-and-numbers",
    "email": "",
    "description": "Publishing local Business Directories in the US and Canada. Names and numbers mission is to connect buyers and sellers through our print, digital and mobile products. We are your one stop to search all things LOCAL! To find out how you can better promote your business, please contact us."
  },
  {
    "name": "Pachena Bay Campground",
    "category": "Campground",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/pachena-bay-campground",
    "email": "",
    "description": "Pachena Bay Campground is located in a magnificent setting on the shores of Pachena Bay, on Vancouver Island, BC, Canada. Offering Regular tenting sites, full service and non-serviced camping sites for RV's."
  },
  {
    "name": "Mountain View Bakery",
    "category": "Fresh Bakery / Deli / Cafe",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mountain-view-bakery",
    "email": "",
    "description": "Fresh everyday all things Bakery! Wraps, Soups, Salads, and Sandwiches made only on Bread baked that morning! Coffee, Espresso, and Lattes at your request!"
  },
  {
    "name": "Nature Impact Incorporated",
    "category": "Wellness",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/nature-impact-incorporated",
    "email": "",
    "description": "Nature Impact offers body, mind, and soul-enriching experiences in Forest Therapy, Creek Adventuring, and Epic Hikes. We intentionally invite others into nature experiences, opening the door to healing, inspiration, and connection with ourselves, each other, and our environment."
  },
  {
    "name": "Parks Canada - Pacific Rim National Park Reserve",
    "category": "National Park",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/parks-canada-pacific-rim-national-park-reserve",
    "email": "",
    "description": "Lying along the west coast of Vancouver Island in the traditional territories of the Nuu-chah-nulth First Nations, Pacific Rim National Park Reserve boasts kilometres of long sandy beaches, unspoiled temperate rainforests and adventures that will delight the explorer in all."
  },
  {
    "name": "Mobius Books Ltd",
    "category": "Bookstore",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/mobius-books-ltd",
    "email": "",
    "description": "We carry all new books: general fiction, non-fiction, children’s, local interest, maps, puzzles, & more. We can special order almost any book in print."
  },
  {
    "name": "Norcan Electrical Systems Inc.",
    "category": "Electrical Systems",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/norcan-electrical-systems-inc",
    "email": "",
    "description": "We have a variety of customized automated feeding solutions that have been installed throughout North America, Norway, Sweden, Australia, Japan, and Chile. We customize each system to meet the needs of our clients. We follow modern standards for the implementation and development of each device we install."
  },
  {
    "name": "NextGen Automation (Formerly AGS Business Systems Inc.)",
    "category": "Business Services",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/nextgen-automation-formerly-ags-business-systems-inc",
    "email": "",
    "description": "NextGen Automation has been a provider of print hardware, software and services for over 20 years. With a team of more than 85 people and 11 office locations across British Columbia, Alberta and Saskatchewan, we provide leading edge technology with efficient, personalized support."
  },
  {
    "name": "Pachena Bay Gas Bar",
    "category": "Fuel Station",
    "address": "Anacla Village, 5 km from Bamfield",
    "phone": "",
    "website": "https://albernichamber.ca/directory/pachena-bay-gas-bar",
    "email": "",
    "description": "The Pachena Bay Gas Bar offers gasoline & diesel, and is the only place to fuel up for your drive out of Bamfield."
  },
  {
    "name": "Panago",
    "category": "Pizza",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/panago",
    "email": "",
    "description": "Panago (formerly known as Panagopoulos) is a Canadian pizza delivery and takeout chain with about 200+ locations across 6 provinces. Panago strives to have better ingredients and options for our customers by having fresh dough made daily in store, organic pizza sauce, meats raised without hormones, multigrain/whole wheat and gluten free dough options, plant based options for our growing vegan community and more. Panago is a franchise business with each location being franchisee-owned and operated."
  },
  {
    "name": "Port Alberni Association for Community Living (P.A.A.C.L)",
    "category": "Non-Profit",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/port-alberni-association-community-living-paacl",
    "email": "",
    "description": "PAACL has a long and highly respected reputation in the community for advocacy and service to people with developmental disabilities and their families. Our history reflects the significant contribution of individuals, their families and friends, our employees, and other concerned citizens for over 50 years."
  },
  {
    "name": "Pescadores Bistro",
    "category": "Restaurant",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/pescadores-bistro",
    "email": "",
    "description": "We are open for Breakfast, Lunch, Brunch and Take Away. Our kitchen uses only the finest freshest ingredients and prepares each dish with utmost attention. Our knowledgeable serving staff will assist you with any dietary questions or concerns."
  },
  {
    "name": "Murphy's Sport Fishing",
    "category": "Sport Fishing",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/murphys-sport-fishing",
    "email": "",
    "description": "You will be in the hands of truly professional guides who are friendly and will put you on fish everyday. On your trip you will find great hospitality, friendly staff, clean comfortable accommodations and great food. You can be assured that you are getting the best value for your sport fishing dollar. We have built Murphy’s on our reputation for great fishing trips, with a customer experience second to nobody."
  },
  {
    "name": "Pacific Fraser Bay Sourcing Inc",
    "category": "Sourcing and Supply Chain Management",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Pacific Fraser Bay Sourcing Inc (PFBSI) is global sourcing and supply chain management experts working in partnership with North American buyers of fashion, home and PPE products. We offer customer and sales support to our clients through our regional sales representatives. We assist our clients through the entire sourcing process from the stage of product inquiry to product delivery. Our main product categories are men’s, women’s, kids wear apparel, accessories and home products. We also specialize in promotional goods and PPE. For over a decade, our sourcing team has been working with clients in the EU, UK and US through our local sourcing partners and factories in Bangladesh, India, China, Sri Lanka, Pakistan and we manage our factories through our sourcing partners."
  },
  {
    "name": "Nanaimo Airport Commission",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/nanaimo-airport-commission",
    "email": "",
    "description": "YCD (Nanaimo Airport) is Vancouver Islands most centrally located Airport based on population and offers regular scheduled flights through Air Canada, WestJet and Pacific Coastal Airlines"
  },
  {
    "name": "Pacific Chevrolet Buick GMC",
    "category": "Automotive Dealership",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Pacific Chevrolet Buick GMC is the Alberni Valleys Largest and only full service automotive dealership. Parts, Sales, Service and ICBC accredited Body shop and Glass Express on site. Pacific Chevrolet carries all the vehicles under the Chevrolet, Buick and GMC brands as well as a variety of all makes and models of pre owned cars, trucks, SUV's. With 27 Full time Employees Pacific Chevrolet has been serving the Alberni Valley, and the West Coast of Vancouver Island including Tofino and Ucuelet for over 30 years."
  },
  {
    "name": "Pathways Leadership Coaching",
    "category": "Business Coaching",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/pathways-leadership-coaching",
    "email": "",
    "description": "Pathways Leadership Coaching is the Alberni Valley’s local business coaching resource focusing on supporting leaders and business owners with clarity, confidence, and direction through personalized coaching."
  },
  {
    "name": "North Island College - Port Alberni Campus",
    "category": "Educational Institution",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/north-island-college-port-alberni-campus",
    "email": "",
    "description": "North Island College (NIC) is honoured to acknowledge the traditional territories of the combined 35 First Nations of the Nuu-chah-nulth, Kwakwaka’wakw and Coast Salish traditions, on whose traditional and unceded territories the college’s campuses are situated. NIC focuses on student success and serves more than 9,000 students annually at its four campuses, learning centre, and through online and in-community learning."
  },
  {
    "name": "Oli Your Island REALTOR® - RE/MAX Mid-Island Realty",
    "category": "Real Estate Agent",
    "address": "",
    "phone": "250-731-6342",
    "website": "",
    "email": "",
    "description": "Oli Your Island REALTOR® - RE/MAX Mid-Island Realty. Providing excellent communication and support for buyers and sellers, including virtual showings."
  },
  {
    "name": "Pinto Goods & Refillery",
    "category": "Local and sustainable goods and refillable products",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Pinto Goods & Refillery offers a variety of local and sustainable goods as well as refillable products."
  },
  {
    "name": "Passion Plumbing & Heating Ltd",
    "category": "Unknown",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/passion-plumbing-heating-ltd#main-content",
    "email": "",
    "description": "Passion Plumbing and Heating Ltd. are a must when the details matter. Licensed, Insured, and Bonded; We are happy to serve you with any of your Plumbing, Gas-Fitting, and Backflow Prevention Needs. Please visit our Website for more info."
  },
  {
    "name": "Noteable Music",
    "category": "Music Instruction",
    "address": "Port Alberni, BC",
    "phone": "",
    "website": "https://albernichamber.ca/directory/noteable-music",
    "email": "",
    "description": "Noteable Music offers a full retail selection with popular brands, quality instruction in various instruments along with music therapy sessions. They provide tailored lessons, instrument repair, and professional sound installation consultation."
  },
  {
    "name": "Outdoor Lovers B & B",
    "category": "Bed and Breakfast",
    "address": "",
    "phone": "",
    "website": "",
    "email": "",
    "description": "Outdoor Lovers Bed and Breakfast is located over-looking the historic Alberni Inlet, once the busiest port in British Columbia and the centre of the booming lumber export trade to Southern California. They are the perfect hub for exploring the East and West coast of Vancouver Island. Drive only an hour to reach the beautiful surfing beaches of Ucluelet and Tofino to the West, the quaint village of Bamfield to the south and the many attractions along the Old Island Highway to the east. At Outdoor Lovers Bed and Breakfast you’re amidst our wilderness surrounded valley and its world class hiking trails. August to October, witness the magnificent Stamp River Chinook Salmon Run. You will see Bears and Bald Eagles!"
  },
  {
    "name": "Port Alberni Community Action Team",
    "category": "Networking and advocacy",
    "address": "",
    "phone": "",
    "website": "https://albernichamber.ca/directory/port-alberni-community-action-team",
    "email": "",
    "description": "Networking and advocacy for the toxic drug crisis"
  }
]